
package model.Finding;

public class FaistosDisk extends RareFinding{

    public FaistosDisk() {
        super(35);
    }

    @Override
    public String toString() {
        return "Ανακάλυψες το Δίσκο της Φαιστού!!!;\nΟ Δίσκος της Φαιστού είναι ένα αρχαιολογικό εύρημα "
                + "από τη Μινωική πόλη της Φαιστού\n στη νότια Κρήτη και χρονολογείται πιθανώς στον 17ο αιώνα π.Χ..\n "
                + "Αποτελεί ένα από τα γνωστότερα μυστήρια της αρχαιολογίας,\n αφού ο σκοπός της κατασκευής του και το νόημα των όσων "
                + "αναγράφονται σε αυτόν παραμένουν άγνωστα.\n Ο δίσκος ανακαλύφθηκε στις 3 Ιουλίου 1908 από τον Ιταλό αρχαιολόγο Λουίτζι"
                + " Περνιέ (Luigi Pernier)\n και φυλάσσεται σήμερα στο Αρχαιολογικό Μουσείο Ηρακλείου.";
    }
    
}
